//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameLogo.cpp
//!
//! @brief  ロゴ処理のソースファイル
//!
//! @date   日付		
//!
//! @author 制作者名	
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "GameLogo.h"
using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief ロゴのコンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
GameLogo::GameLogo()
{
	cnt = 0;
}
//----------------------------------------------------------------------
//! @brief ロゴのデストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
GameLogo::~GameLogo()
{

}



//----------------------------------------------------------------------
//! @brief ロゴ描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameLogo::Update()
{

	cnt++;
	if (cnt > 120)
	{
		g_NextScene = TITLE;
	}

}

//----------------------------------------------------------------------
//! @brief ロゴ描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameLogo::Render()
{
	RECT rect;
	wchar_t buf[256];

	

	// 左上と右下を指定
	rect = { 0, 0, 1280, 1280 };

	g_spriteBatch->Draw(g_logos->m_pTexture, Vector2(150, 50),
		&rect, Colors::White, /*回転のradian値*/0.0f, /*中心の回転座標*/Vector2(0, 0), /*拡大倍率*/Vector2(0.25, 0.25));

	
}

