//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameClear.cpp
//!
//! @brief  ゲームクリア処理のソースファイル
//!
//! @date   日付		
//!
//! @author 制作者名	
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "GameClear.h"
using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief ゲームクリアのコンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
GameClear::GameClear()
{
	cnt = 0;
}
//----------------------------------------------------------------------
//! @brief ゲームクリアのデストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
GameClear::~GameClear()
{

}


//----------------------------------------------------------------------
//! @brief ゲームクリア処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameClear::Update()
{
	if (g_init == 0)
	{
		g_init = 1;

		cnt = 0;

		
	}

	cnt++;
	if (cnt > 120)
	{
		g_NextScene = TITLE;
	}

}


//----------------------------------------------------------------------
//! @brief ゲームクリア描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameClear::Render()
{
	RECT rect;
	
	
	rect = { 0, 0, 640,480 };

	g_spriteBatch->Draw(g_clear->m_pTexture, Vector2(0, 0),
		&rect, Colors::White, /*回転のradian値*/0.0f, /*中心の回転座標*/Vector2(0, 0), /*拡大倍率*/Vector2(1, 1));

	

}
